## Terraform Plan - Infrastructure

**Status**: PASSED
**Action**: Plan generated successfully

<details>
<summary>Show Plan Output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # docker_container.registry will be created
  + resource "docker_container" "registry" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (known after apply)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = "registry:2"
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "registry"
      + network_data                                = (known after apply)
      + network_mode                                = "bridge"
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "always"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval       = (known after apply)
          + retries        = (known after apply)
          + start_interval = (known after apply)
          + start_period   = (known after apply)
          + test           = (known after apply)
          + timeout        = (known after apply)
        }

      + labels {
          + label = (known after apply)
          + value = (known after apply)
        }

      + ports {
          + external = 5000
          + internal = 5000
          + ip       = "127.0.0.1"
          + protocol = "tcp"
        }
    }

  # helm_release.grafana will be created
  + resource "helm_release" "grafana" {
      + atomic                     = false
      + chart                      = "grafana"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "grafana"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive),
        ]
      + verify                     = false
      + version                    = "9.4.5"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.guestbook_backend will be created
  + resource "helm_release" "guestbook_backend" {
      + atomic                     = false
      + chart                      = "./charts/guestbook-backend"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "guestbook-backend"
      + namespace                  = "application"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "env":
                  "port": "8080"
                "image":
                  "pullPolicy": "Always"
                  "repository": "localhost:5000/python-guestbook-backend"
                  "tag": "latest"
                "initContainer":
                  "enabled": true
                  "image":
                    "repository": "mongo"
                    "tag": "4.4"
                "livenessProbe":
                  "enabled": true
                  "httpGet":
                    "path": "/health"
                    "port": 8080
                  "initialDelaySeconds": 30
                  "periodSeconds": 10
                "metrics":
                  "annotations":
                    "prometheus.io/path": "/metrics"
                    "prometheus.io/port": "8080"
                    "prometheus.io/scrape": "true"
                  "enabled": true
                  "serviceMonitor":
                    "enabled": true
                    "endpoint":
                      "interval": "30s"
                      "path": "/metrics"
                      "port": "http"
                      "scrapeTimeout": "10s"
                    "labels":
                      "release": "prometheus"
                "mongodb":
                  "existingSecret": "mongodb-auth"
                "readinessProbe":
                  "enabled": true
                  "httpGet":
                    "path": "/ready"
                    "port": 8080
                  "initialDelaySeconds": 5
                  "periodSeconds": 5
                "resources":
                  "limits":
                    "cpu": "100m"
                    "memory": "256Mi"
                  "requests":
                    "cpu": "50m"
                    "memory": "128Mi"
                "service":
                  "port": 8080
                  "type": "ClusterIP"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.guestbook_frontend will be created
  + resource "helm_release" "guestbook_frontend" {
      + atomic                     = false
      + chart                      = "./charts/guestbook-frontend"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "guestbook-frontend"
      + namespace                  = "application"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "env":
                  "guestbookApiAddr": "guestbook-backend.application.svc.cluster.local:8080"
                  "port": "8080"
                "image":
                  "pullPolicy": "Always"
                  "repository": "localhost:5000/python-guestbook-frontend"
                  "tag": "latest"
                "ingress":
                  "enabled": true
                  "hosts":
                  - "host": "localhost"
                    "paths":
                    - "path": "/"
                      "pathType": "Prefix"
                "livenessProbe":
                  "enabled": true
                  "httpGet":
                    "path": "/health"
                    "port": 8080
                  "initialDelaySeconds": 30
                  "periodSeconds": 10
                "metrics":
                  "annotations":
                    "prometheus.io/path": "/metrics"
                    "prometheus.io/port": "8080"
                    "prometheus.io/scrape": "true"
                  "enabled": true
                  "serviceMonitor":
                    "enabled": true
                    "endpoint":
                      "interval": "30s"
                      "path": "/metrics"
                      "port": "http"
                      "scrapeTimeout": "10s"
                    "labels":
                      "release": "prometheus"
                "readinessProbe":
                  "enabled": true
                  "httpGet":
                    "path": "/ready"
                    "port": 8080
                  "initialDelaySeconds": 5
                  "periodSeconds": 5
                "resources":
                  "limits":
                    "cpu": "50m"
                    "memory": "128Mi"
                  "requests":
                    "cpu": "25m"
                    "memory": "64Mi"
                "service":
                  "port": 80
                  "type": "ClusterIP"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.loki will be created
  + resource "helm_release" "loki" {
      + atomic                     = false
      + chart                      = "loki"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "loki"
      + namespace                  = "logging"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "deploymentMode": "SingleBinary"
                "loki":
                  "auth_enabled": false
                  "commonConfig":
                    "replication_factor": 1
                  "schemaConfig":
                    "configs":
                    - "from": "2024-01-01"
                      "index":
                        "period": "24h"
                        "prefix": "index_"
                      "object_store": "filesystem"
                      "schema": "v13"
                      "store": "tsdb"
                  "storage":
                    "type": "filesystem"
                "singleBinary":
                  "persistence":
                    "enabled": true
                    "size": "5Gi"
                  "replicas": 1
            EOT,
        ]
      + verify                     = false
      + version                    = "5.47.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.mongodb will be created
  + resource "helm_release" "mongodb" {
      + atomic                     = false
      + chart                      = "./charts/mongodb"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "mongodb"
      + namespace                  = "database"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "auth":
                  "enabled": true
                  "existingSecret": "mongodb-auth"
                "persistence":
                  "enabled": true
                  "size": "5Gi"
                "resources":
                  "limits":
                    "cpu": "200m"
                    "memory": "512Mi"
                  "requests":
                    "cpu": "100m"
                    "memory": "256Mi"
                "service":
                  "port": 27017
                  "type": "ClusterIP"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.prometheus will be created
  + resource "helm_release" "prometheus" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + <<-EOT
                "alertmanager":
                  "enabled": false
                "grafana":
                  "enabled": false
                "prometheus":
                  "prometheusSpec":
                    "storageSpec":
                      "volumeClaimTemplate":
                        "spec":
                          "accessModes":
                          - "ReadWriteOnce"
                          "resources":
                            "requests":
                              "storage": "10Gi"
            EOT,
        ]
      + verify                     = false
      + version                    = "77.9.1"
      + wait                       = true
      + wait_for_jobs              = true
    }

  # helm_release.promtail will be created
  + resource "helm_release" "promtail" {
      + atomic                     = false
      + chart                      = "promtail"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "promtail"
      + namespace                  = "logging"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "config":
                  "clients":
                  - "url": "http://loki.logging.svc.cluster.local:3100/loki/api/v1/push"
                "daemonset":
                  "enabled": true
            EOT,
        ]
      + verify                     = false
      + version                    = "6.16.6"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kind_cluster.default will be created
  + resource "kind_cluster" "default" {
      + client_certificate     = (known after apply)
      + client_key             = (known after apply)
      + cluster_ca_certificate = (known after apply)
      + completed              = (known after apply)
      + endpoint               = (known after apply)
      + id                     = (known after apply)
      + kubeconfig             = (known after apply)
      + kubeconfig_path        = (known after apply)
      + name                   = "aa-cluster"
      + node_image             = (known after apply)
      + wait_for_ready         = true

      + kind_config {
          + api_version               = "kind.x-k8s.io/v1alpha4"
          + containerd_config_patches = [
              + <<-EOT
                    [plugins."io.containerd.grpc.v1.cri".registry.mirrors."localhost:5000"]
                      endpoint = ["http://registry:5000"]
                EOT,
            ]
          + kind                      = "Cluster"

          + node {
              + kubeadm_config_patches = [
                  + <<-EOT
                        kind: InitConfiguration
                        nodeRegistration:
                          kubeletExtraArgs:
                            node-labels: "ingress-ready=true"
                    EOT,
                ]
              + role                   = "control-plane"

              + extra_port_mappings {
                  + container_port = 80
                  + host_port      = 80
                  + protocol       = "TCP"
                }
              + extra_port_mappings {
                  + container_port = 443
                  + host_port      = 443
                  + protocol       = "TCP"
                }
            }
        }
    }

  # kubernetes_config_map.local_registry_hosting will be created
  + resource "kubernetes_config_map" "local_registry_hosting" {
      + data = {
          + "localRegistryHosting.v1" = <<-EOT
                host: "localhost:5000"
                help: "https://kind.sigs.k8s.io/docs/user/local-registry/"
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "local-registry-hosting"
          + namespace        = "kube-public"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_ingress_v1.grafana will be created
  + resource "kubernetes_ingress_v1" "grafana" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "nginx.ingress.kubernetes.io/rewrite-target" = "/"
            }
          + generation       = (known after apply)
          + name             = "grafana"
          + namespace        = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "nginx"

          + rule {
              + host = "grafana.localhost"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {

                          + service {
                              + name = "grafana"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # kubernetes_ingress_v1.prometheus will be created
  + resource "kubernetes_ingress_v1" "prometheus" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "nginx.ingress.kubernetes.io/rewrite-target" = "/"
            }
          + generation       = (known after apply)
          + name             = "prometheus"
          + namespace        = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "nginx"

          + rule {
              + host = "prometheus.localhost"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {

                          + service {
                              + name = "prometheus-kube-prometheus-prometheus"

                              + port {
                                  + number = 9090
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # kubernetes_namespace.application will be created
  + resource "kubernetes_namespace" "application" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "managed-by" = "terraform"
              + "name"       = "application"
              + "purpose"    = "workload"
            }
          + name             = "application"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.cluster_management will be created
  + resource "kubernetes_namespace" "cluster_management" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "managed-by" = "terraform"
              + "name"       = "kube-dashboard"
              + "purpose"    = "cluster-management"
            }
          + name             = "cluster-management"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.database will be created
  + resource "kubernetes_namespace" "database" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "managed-by" = "terraform"
              + "name"       = "database"
              + "purpose"    = "data"
            }
          + name             = "database"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.logging will be created
  + resource "kubernetes_namespace" "logging" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "managed-by" = "terraform"
              + "name"       = "logging"
              + "purpose"    = "observability"
            }
          + name             = "logging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.monitoring will be created
  + resource "kubernetes_namespace" "monitoring" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "managed-by" = "terraform"
              + "name"       = "monitoring"
              + "purpose"    = "observability"
            }
          + name             = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.grafana_auth will be created
  + resource "kubernetes_secret" "grafana_auth" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"        = "grafana"
              + "managed-by" = "terraform"
            }
          + name             = "grafana-auth"
          + namespace        = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.mongodb_auth["app"] will be created
  + resource "kubernetes_secret" "mongodb_auth" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"        = "app"
              + "managed-by" = "terraform"
            }
          + name             = "mongodb-auth"
          + namespace        = "application"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.mongodb_auth["database"] will be created
  + resource "kubernetes_secret" "mongodb_auth" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"        = "database"
              + "managed-by" = "terraform"
            }
          + name             = "mongodb-auth"
          + namespace        = "database"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # local_file.ingress_nginx_yaml will be created
  + resource "local_file" "ingress_nginx_yaml" {
      + content              = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              labels:
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
              name: ingress-nginx
            ---
            apiVersion: v1
            automountServiceAccountToken: true
            kind: ServiceAccount
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx
              namespace: ingress-nginx
            ---
            apiVersion: v1
            automountServiceAccountToken: true
            kind: ServiceAccount
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission
              namespace: ingress-nginx
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: Role
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx
              namespace: ingress-nginx
            rules:
            - apiGroups:
              - ""
              resources:
              - namespaces
              verbs:
              - get
            - apiGroups:
              - ""
              resources:
              - configmaps
              - pods
              - secrets
              - endpoints
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - ""
              resources:
              - services
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - networking.k8s.io
              resources:
              - ingresses
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - networking.k8s.io
              resources:
              - ingresses/status
              verbs:
              - update
            - apiGroups:
              - networking.k8s.io
              resources:
              - ingressclasses
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - coordination.k8s.io
              resourceNames:
              - ingress-nginx-leader
              resources:
              - leases
              verbs:
              - get
              - update
            - apiGroups:
              - coordination.k8s.io
              resources:
              - leases
              verbs:
              - create
            - apiGroups:
              - ""
              resources:
              - events
              verbs:
              - create
              - patch
            - apiGroups:
              - discovery.k8s.io
              resources:
              - endpointslices
              verbs:
              - list
              - watch
              - get
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: Role
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission
              namespace: ingress-nginx
            rules:
            - apiGroups:
              - ""
              resources:
              - secrets
              verbs:
              - get
              - create
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx
            rules:
            - apiGroups:
              - ""
              resources:
              - configmaps
              - endpoints
              - nodes
              - pods
              - secrets
              - namespaces
              verbs:
              - list
              - watch
            - apiGroups:
              - coordination.k8s.io
              resources:
              - leases
              verbs:
              - list
              - watch
            - apiGroups:
              - ""
              resources:
              - nodes
              verbs:
              - get
            - apiGroups:
              - ""
              resources:
              - services
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - networking.k8s.io
              resources:
              - ingresses
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - ""
              resources:
              - events
              verbs:
              - create
              - patch
            - apiGroups:
              - networking.k8s.io
              resources:
              - ingresses/status
              verbs:
              - update
            - apiGroups:
              - networking.k8s.io
              resources:
              - ingressclasses
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - discovery.k8s.io
              resources:
              - endpointslices
              verbs:
              - list
              - watch
              - get
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission
            rules:
            - apiGroups:
              - admissionregistration.k8s.io
              resources:
              - validatingwebhookconfigurations
              verbs:
              - get
              - update
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: RoleBinding
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx
              namespace: ingress-nginx
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: Role
              name: ingress-nginx
            subjects:
            - kind: ServiceAccount
              name: ingress-nginx
              namespace: ingress-nginx
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: RoleBinding
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission
              namespace: ingress-nginx
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: Role
              name: ingress-nginx-admission
            subjects:
            - kind: ServiceAccount
              name: ingress-nginx-admission
              namespace: ingress-nginx
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              labels:
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: ingress-nginx
            subjects:
            - kind: ServiceAccount
              name: ingress-nginx
              namespace: ingress-nginx
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: ingress-nginx-admission
            subjects:
            - kind: ServiceAccount
              name: ingress-nginx-admission
              namespace: ingress-nginx
            ---
            apiVersion: v1
            data: null
            kind: ConfigMap
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-controller
              namespace: ingress-nginx
            ---
            apiVersion: v1
            kind: Service
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-controller
              namespace: ingress-nginx
            spec:
              ipFamilies:
              - IPv4
              ipFamilyPolicy: SingleStack
              ports:
              - appProtocol: http
                name: http
                port: 80
                protocol: TCP
                targetPort: http
              - appProtocol: https
                name: https
                port: 443
                protocol: TCP
                targetPort: https
              selector:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
              type: LoadBalancer
            ---
            apiVersion: v1
            kind: Service
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-controller-admission
              namespace: ingress-nginx
            spec:
              ports:
              - appProtocol: https
                name: https-webhook
                port: 443
                targetPort: webhook
              selector:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
              type: ClusterIP
            ---
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-controller
              namespace: ingress-nginx
            spec:
              minReadySeconds: 0
              revisionHistoryLimit: 10
              selector:
                matchLabels:
                  app.kubernetes.io/component: controller
                  app.kubernetes.io/instance: ingress-nginx
                  app.kubernetes.io/name: ingress-nginx
              strategy:
                rollingUpdate:
                  maxUnavailable: 1
                type: RollingUpdate
              template:
                metadata:
                  labels:
                    app.kubernetes.io/component: controller
                    app.kubernetes.io/instance: ingress-nginx
                    app.kubernetes.io/name: ingress-nginx
                    app.kubernetes.io/part-of: ingress-nginx
                    app.kubernetes.io/version: 1.13.2
                spec:
                  automountServiceAccountToken: true
                  containers:
                  - args:
                    - /nginx-ingress-controller
                    - --election-id=ingress-nginx-leader
                    - --controller-class=k8s.io/ingress-nginx
                    - --ingress-class=nginx
                    - --configmap=$(POD_NAMESPACE)/ingress-nginx-controller
                    - --validating-webhook=:8443
                    - --validating-webhook-certificate=/usr/local/certificates/cert
                    - --validating-webhook-key=/usr/local/certificates/key
                    - --watch-ingress-without-class=true
                    - --publish-status-address=localhost
                    env:
                    - name: POD_NAME
                      valueFrom:
                        fieldRef:
                          fieldPath: metadata.name
                    - name: POD_NAMESPACE
                      valueFrom:
                        fieldRef:
                          fieldPath: metadata.namespace
                    - name: LD_PRELOAD
                      value: /usr/local/lib/libmimalloc.so
                    image: registry.k8s.io/ingress-nginx/controller:v1.13.2@sha256:1f7eaeb01933e719c8a9f4acd8181e555e582330c7d50f24484fb64d2ba9b2ef
                    imagePullPolicy: IfNotPresent
                    lifecycle:
                      preStop:
                        exec:
                          command:
                          - /wait-shutdown
                    livenessProbe:
                      failureThreshold: 5
                      httpGet:
                        path: /healthz
                        port: 10254
                        scheme: HTTP
                      initialDelaySeconds: 10
                      periodSeconds: 10
                      successThreshold: 1
                      timeoutSeconds: 1
                    name: controller
                    ports:
                    - containerPort: 80
                      hostPort: 80
                      name: http
                      protocol: TCP
                    - containerPort: 443
                      hostPort: 443
                      name: https
                      protocol: TCP
                    - containerPort: 8443
                      name: webhook
                      protocol: TCP
                    readinessProbe:
                      failureThreshold: 3
                      httpGet:
                        path: /healthz
                        port: 10254
                        scheme: HTTP
                      initialDelaySeconds: 10
                      periodSeconds: 10
                      successThreshold: 1
                      timeoutSeconds: 1
                    resources:
                      requests:
                        cpu: 100m
                        memory: 90Mi
                    securityContext:
                      allowPrivilegeEscalation: false
                      capabilities:
                        add:
                        - NET_BIND_SERVICE
                        drop:
                        - ALL
                      readOnlyRootFilesystem: false
                      runAsGroup: 82
                      runAsNonRoot: true
                      runAsUser: 101
                      seccompProfile:
                        type: RuntimeDefault
                    volumeMounts:
                    - mountPath: /usr/local/certificates/
                      name: webhook-cert
                      readOnly: true
                  dnsPolicy: ClusterFirst
                  nodeSelector:
                    kubernetes.io/os: linux
                  serviceAccountName: ingress-nginx
                  terminationGracePeriodSeconds: 0
                  tolerations:
                  - effect: NoSchedule
                    key: node-role.kubernetes.io/master
                    operator: Equal
                  - effect: NoSchedule
                    key: node-role.kubernetes.io/control-plane
                    operator: Equal
                  volumes:
                  - name: webhook-cert
                    secret:
                      secretName: ingress-nginx-admission
            ---
            apiVersion: batch/v1
            kind: Job
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission-create
              namespace: ingress-nginx
            spec:
              template:
                metadata:
                  labels:
                    app.kubernetes.io/component: admission-webhook
                    app.kubernetes.io/instance: ingress-nginx
                    app.kubernetes.io/name: ingress-nginx
                    app.kubernetes.io/part-of: ingress-nginx
                    app.kubernetes.io/version: 1.13.2
                  name: ingress-nginx-admission-create
                spec:
                  automountServiceAccountToken: true
                  containers:
                  - args:
                    - create
                    - --host=ingress-nginx-controller-admission,ingress-nginx-controller-admission.$(POD_NAMESPACE).svc
                    - --namespace=$(POD_NAMESPACE)
                    - --secret-name=ingress-nginx-admission
                    env:
                    - name: POD_NAMESPACE
                      valueFrom:
                        fieldRef:
                          fieldPath: metadata.namespace
                    image: registry.k8s.io/ingress-nginx/kube-webhook-certgen:v1.6.2@sha256:050a34002d5bb4966849c880c56c91f5320372564245733b33d4b3461b4dbd24
                    imagePullPolicy: IfNotPresent
                    name: create
                    securityContext:
                      allowPrivilegeEscalation: false
                      capabilities:
                        drop:
                        - ALL
                      readOnlyRootFilesystem: true
                      runAsGroup: 65532
                      runAsNonRoot: true
                      runAsUser: 65532
                      seccompProfile:
                        type: RuntimeDefault
                  nodeSelector:
                    kubernetes.io/os: linux
                  restartPolicy: OnFailure
                  serviceAccountName: ingress-nginx-admission
              ttlSecondsAfterFinished: 0
            ---
            apiVersion: batch/v1
            kind: Job
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission-patch
              namespace: ingress-nginx
            spec:
              template:
                metadata:
                  labels:
                    app.kubernetes.io/component: admission-webhook
                    app.kubernetes.io/instance: ingress-nginx
                    app.kubernetes.io/name: ingress-nginx
                    app.kubernetes.io/part-of: ingress-nginx
                    app.kubernetes.io/version: 1.13.2
                  name: ingress-nginx-admission-patch
                spec:
                  automountServiceAccountToken: true
                  containers:
                  - args:
                    - patch
                    - --webhook-name=ingress-nginx-admission
                    - --namespace=$(POD_NAMESPACE)
                    - --patch-mutating=false
                    - --secret-name=ingress-nginx-admission
                    - --patch-failure-policy=Fail
                    env:
                    - name: POD_NAMESPACE
                      valueFrom:
                        fieldRef:
                          fieldPath: metadata.namespace
                    image: registry.k8s.io/ingress-nginx/kube-webhook-certgen:v1.6.2@sha256:050a34002d5bb4966849c880c56c91f5320372564245733b33d4b3461b4dbd24
                    imagePullPolicy: IfNotPresent
                    name: patch
                    securityContext:
                      allowPrivilegeEscalation: false
                      capabilities:
                        drop:
                        - ALL
                      readOnlyRootFilesystem: true
                      runAsGroup: 65532
                      runAsNonRoot: true
                      runAsUser: 65532
                      seccompProfile:
                        type: RuntimeDefault
                  nodeSelector:
                    kubernetes.io/os: linux
                  restartPolicy: OnFailure
                  serviceAccountName: ingress-nginx-admission
              ttlSecondsAfterFinished: 0
            ---
            apiVersion: networking.k8s.io/v1
            kind: IngressClass
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: nginx
            spec:
              controller: k8s.io/ingress-nginx
            ---
            apiVersion: admissionregistration.k8s.io/v1
            kind: ValidatingWebhookConfiguration
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission
            webhooks:
            - admissionReviewVersions:
              - v1
              clientConfig:
                service:
                  name: ingress-nginx-controller-admission
                  namespace: ingress-nginx
                  path: /networking/v1/ingresses
                  port: 443
              failurePolicy: Fail
              matchPolicy: Equivalent
              name: validate.nginx.ingress.kubernetes.io
              rules:
              - apiGroups:
                - networking.k8s.io
                apiVersions:
                - v1
                operations:
                - CREATE
                - UPDATE
                resources:
                - ingresses
              sideEffects: None
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./assets/ingress-nginx-deploy.yaml"
      + id                   = (known after apply)
    }

  # null_resource.apply_ingress_nginx will be created
  + resource "null_resource" "apply_ingress_nginx" {
      + id = (known after apply)
    }

  # null_resource.connect_registry will be created
  + resource "null_resource" "connect_registry" {
      + id = (known after apply)
    }

Plan: 23 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # docker_container.registry will be created
  + resource "docker_container" "registry" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (known after apply)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = "registry:2"
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "registry"
      + network_data                                = (known after apply)
      + network_mode                                = "bridge"
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "always"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval       = (known after apply)
          + retries        = (known after apply)
          + start_interval = (known after apply)
          + start_period   = (known after apply)
          + test           = (known after apply)
          + timeout        = (known after apply)
        }

      + labels {
          + label = (known after apply)
          + value = (known after apply)
        }

      + ports {
          + external = 5000
          + internal = 5000
          + ip       = "127.0.0.1"
          + protocol = "tcp"
        }
    }

  # helm_release.grafana will be created
  + resource "helm_release" "grafana" {
      + atomic                     = false
      + chart                      = "grafana"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "grafana"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive),
        ]
      + verify                     = false
      + version                    = "9.4.5"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.guestbook_backend will be created
  + resource "helm_release" "guestbook_backend" {
      + atomic                     = false
      + chart                      = "./charts/guestbook-backend"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "guestbook-backend"
      + namespace                  = "application"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "env":
                  "port": "8080"
                "image":
                  "pullPolicy": "Always"
                  "repository": "localhost:5000/python-guestbook-backend"
                  "tag": "latest"
                "initContainer":
                  "enabled": true
                  "image":
                    "repository": "mongo"
                    "tag": "4.4"
                "livenessProbe":
                  "enabled": true
                  "httpGet":
                    "path": "/health"
                    "port": 8080
                  "initialDelaySeconds": 30
                  "periodSeconds": 10
                "metrics":
                  "annotations":
                    "prometheus.io/path": "/metrics"
                    "prometheus.io/port": "8080"
                    "prometheus.io/scrape": "true"
                  "enabled": true
                  "serviceMonitor":
                    "enabled": true
                    "endpoint":
                      "interval": "30s"
                      "path": "/metrics"
                      "port": "http"
                      "scrapeTimeout": "10s"
                    "labels":
                      "release": "prometheus"
                "mongodb":
                  "existingSecret": "mongodb-auth"
                "readinessProbe":
                  "enabled": true
                  "httpGet":
                    "path": "/ready"
                    "port": 8080
                  "initialDelaySeconds": 5
                  "periodSeconds": 5
                "resources":
                  "limits":
                    "cpu": "100m"
                    "memory": "256Mi"
                  "requests":
                    "cpu": "50m"
                    "memory": "128Mi"
                "service":
                  "port": 8080
                  "type": "ClusterIP"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.guestbook_frontend will be created
  + resource "helm_release" "guestbook_frontend" {
      + atomic                     = false
      + chart                      = "./charts/guestbook-frontend"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "guestbook-frontend"
      + namespace                  = "application"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "env":
                  "guestbookApiAddr": "guestbook-backend.application.svc.cluster.local:8080"
                  "port": "8080"
                "image":
                  "pullPolicy": "Always"
                  "repository": "localhost:5000/python-guestbook-frontend"
                  "tag": "latest"
                "ingress":
                  "enabled": true
                  "hosts":
                  - "host": "localhost"
                    "paths":
                    - "path": "/"
                      "pathType": "Prefix"
                "livenessProbe":
                  "enabled": true
                  "httpGet":
                    "path": "/health"
                    "port": 8080
                  "initialDelaySeconds": 30
                  "periodSeconds": 10
                "metrics":
                  "annotations":
                    "prometheus.io/path": "/metrics"
                    "prometheus.io/port": "8080"
                    "prometheus.io/scrape": "true"
                  "enabled": true
                  "serviceMonitor":
                    "enabled": true
                    "endpoint":
                      "interval": "30s"
                      "path": "/metrics"
                      "port": "http"
                      "scrapeTimeout": "10s"
                    "labels":
                      "release": "prometheus"
                "readinessProbe":
                  "enabled": true
                  "httpGet":
                    "path": "/ready"
                    "port": 8080
                  "initialDelaySeconds": 5
                  "periodSeconds": 5
                "resources":
                  "limits":
                    "cpu": "50m"
                    "memory": "128Mi"
                  "requests":
                    "cpu": "25m"
                    "memory": "64Mi"
                "service":
                  "port": 80
                  "type": "ClusterIP"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.loki will be created
  + resource "helm_release" "loki" {
      + atomic                     = false
      + chart                      = "loki"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "loki"
      + namespace                  = "logging"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "deploymentMode": "SingleBinary"
                "loki":
                  "auth_enabled": false
                  "commonConfig":
                    "replication_factor": 1
                  "schemaConfig":
                    "configs":
                    - "from": "2024-01-01"
                      "index":
                        "period": "24h"
                        "prefix": "index_"
                      "object_store": "filesystem"
                      "schema": "v13"
                      "store": "tsdb"
                  "storage":
                    "type": "filesystem"
                "singleBinary":
                  "persistence":
                    "enabled": true
                    "size": "5Gi"
                  "replicas": 1
            EOT,
        ]
      + verify                     = false
      + version                    = "5.47.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.mongodb will be created
  + resource "helm_release" "mongodb" {
      + atomic                     = false
      + chart                      = "./charts/mongodb"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "mongodb"
      + namespace                  = "database"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "auth":
                  "enabled": true
                  "existingSecret": "mongodb-auth"
                "persistence":
                  "enabled": true
                  "size": "5Gi"
                "resources":
                  "limits":
                    "cpu": "200m"
                    "memory": "512Mi"
                  "requests":
                    "cpu": "100m"
                    "memory": "256Mi"
                "service":
                  "port": 27017
                  "type": "ClusterIP"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.prometheus will be created
  + resource "helm_release" "prometheus" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + <<-EOT
                "alertmanager":
                  "enabled": false
                "grafana":
                  "enabled": false
                "prometheus":
                  "prometheusSpec":
                    "storageSpec":
                      "volumeClaimTemplate":
                        "spec":
                          "accessModes":
                          - "ReadWriteOnce"
                          "resources":
                            "requests":
                              "storage": "10Gi"
            EOT,
        ]
      + verify                     = false
      + version                    = "77.9.1"
      + wait                       = true
      + wait_for_jobs              = true
    }

  # helm_release.promtail will be created
  + resource "helm_release" "promtail" {
      + atomic                     = false
      + chart                      = "promtail"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "promtail"
      + namespace                  = "logging"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "config":
                  "clients":
                  - "url": "http://loki.logging.svc.cluster.local:3100/loki/api/v1/push"
                "daemonset":
                  "enabled": true
            EOT,
        ]
      + verify                     = false
      + version                    = "6.16.6"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kind_cluster.default will be created
  + resource "kind_cluster" "default" {
      + client_certificate     = (known after apply)
      + client_key             = (known after apply)
      + cluster_ca_certificate = (known after apply)
      + completed              = (known after apply)
      + endpoint               = (known after apply)
      + id                     = (known after apply)
      + kubeconfig             = (known after apply)
      + kubeconfig_path        = (known after apply)
      + name                   = "aa-cluster"
      + node_image             = (known after apply)
      + wait_for_ready         = true

      + kind_config {
          + api_version               = "kind.x-k8s.io/v1alpha4"
          + containerd_config_patches = [
              + <<-EOT
                    [plugins."io.containerd.grpc.v1.cri".registry.mirrors."localhost:5000"]
                      endpoint = ["http://registry:5000"]
                EOT,
            ]
          + kind                      = "Cluster"

          + node {
              + kubeadm_config_patches = [
                  + <<-EOT
                        kind: InitConfiguration
                        nodeRegistration:
                          kubeletExtraArgs:
                            node-labels: "ingress-ready=true"
                    EOT,
                ]
              + role                   = "control-plane"

              + extra_port_mappings {
                  + container_port = 80
                  + host_port      = 80
                  + protocol       = "TCP"
                }
              + extra_port_mappings {
                  + container_port = 443
                  + host_port      = 443
                  + protocol       = "TCP"
                }
            }
        }
    }

  # kubernetes_config_map.local_registry_hosting will be created
  + resource "kubernetes_config_map" "local_registry_hosting" {
      + data = {
          + "localRegistryHosting.v1" = <<-EOT
                host: "localhost:5000"
                help: "https://kind.sigs.k8s.io/docs/user/local-registry/"
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "local-registry-hosting"
          + namespace        = "kube-public"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_ingress_v1.grafana will be created
  + resource "kubernetes_ingress_v1" "grafana" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "nginx.ingress.kubernetes.io/rewrite-target" = "/"
            }
          + generation       = (known after apply)
          + name             = "grafana"
          + namespace        = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "nginx"

          + rule {
              + host = "grafana.localhost"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {

                          + service {
                              + name = "grafana"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # kubernetes_ingress_v1.prometheus will be created
  + resource "kubernetes_ingress_v1" "prometheus" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "nginx.ingress.kubernetes.io/rewrite-target" = "/"
            }
          + generation       = (known after apply)
          + name             = "prometheus"
          + namespace        = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "nginx"

          + rule {
              + host = "prometheus.localhost"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {

                          + service {
                              + name = "prometheus-kube-prometheus-prometheus"

                              + port {
                                  + number = 9090
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # kubernetes_namespace.application will be created
  + resource "kubernetes_namespace" "application" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "managed-by" = "terraform"
              + "name"       = "application"
              + "purpose"    = "workload"
            }
          + name             = "application"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.cluster_management will be created
  + resource "kubernetes_namespace" "cluster_management" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "managed-by" = "terraform"
              + "name"       = "kube-dashboard"
              + "purpose"    = "cluster-management"
            }
          + name             = "cluster-management"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.database will be created
  + resource "kubernetes_namespace" "database" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "managed-by" = "terraform"
              + "name"       = "database"
              + "purpose"    = "data"
            }
          + name             = "database"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.logging will be created
  + resource "kubernetes_namespace" "logging" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "managed-by" = "terraform"
              + "name"       = "logging"
              + "purpose"    = "observability"
            }
          + name             = "logging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.monitoring will be created
  + resource "kubernetes_namespace" "monitoring" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "managed-by" = "terraform"
              + "name"       = "monitoring"
              + "purpose"    = "observability"
            }
          + name             = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.grafana_auth will be created
  + resource "kubernetes_secret" "grafana_auth" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"        = "grafana"
              + "managed-by" = "terraform"
            }
          + name             = "grafana-auth"
          + namespace        = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.mongodb_auth["app"] will be created
  + resource "kubernetes_secret" "mongodb_auth" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"        = "app"
              + "managed-by" = "terraform"
            }
          + name             = "mongodb-auth"
          + namespace        = "application"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.mongodb_auth["database"] will be created
  + resource "kubernetes_secret" "mongodb_auth" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"        = "database"
              + "managed-by" = "terraform"
            }
          + name             = "mongodb-auth"
          + namespace        = "database"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # local_file.ingress_nginx_yaml will be created
  + resource "local_file" "ingress_nginx_yaml" {
      + content              = <<-EOT
            apiVersion: v1
            kind: Namespace
            metadata:
              labels:
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
              name: ingress-nginx
            ---
            apiVersion: v1
            automountServiceAccountToken: true
            kind: ServiceAccount
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx
              namespace: ingress-nginx
            ---
            apiVersion: v1
            automountServiceAccountToken: true
            kind: ServiceAccount
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission
              namespace: ingress-nginx
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: Role
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx
              namespace: ingress-nginx
            rules:
            - apiGroups:
              - ""
              resources:
              - namespaces
              verbs:
              - get
            - apiGroups:
              - ""
              resources:
              - configmaps
              - pods
              - secrets
              - endpoints
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - ""
              resources:
              - services
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - networking.k8s.io
              resources:
              - ingresses
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - networking.k8s.io
              resources:
              - ingresses/status
              verbs:
              - update
            - apiGroups:
              - networking.k8s.io
              resources:
              - ingressclasses
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - coordination.k8s.io
              resourceNames:
              - ingress-nginx-leader
              resources:
              - leases
              verbs:
              - get
              - update
            - apiGroups:
              - coordination.k8s.io
              resources:
              - leases
              verbs:
              - create
            - apiGroups:
              - ""
              resources:
              - events
              verbs:
              - create
              - patch
            - apiGroups:
              - discovery.k8s.io
              resources:
              - endpointslices
              verbs:
              - list
              - watch
              - get
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: Role
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission
              namespace: ingress-nginx
            rules:
            - apiGroups:
              - ""
              resources:
              - secrets
              verbs:
              - get
              - create
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx
            rules:
            - apiGroups:
              - ""
              resources:
              - configmaps
              - endpoints
              - nodes
              - pods
              - secrets
              - namespaces
              verbs:
              - list
              - watch
            - apiGroups:
              - coordination.k8s.io
              resources:
              - leases
              verbs:
              - list
              - watch
            - apiGroups:
              - ""
              resources:
              - nodes
              verbs:
              - get
            - apiGroups:
              - ""
              resources:
              - services
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - networking.k8s.io
              resources:
              - ingresses
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - ""
              resources:
              - events
              verbs:
              - create
              - patch
            - apiGroups:
              - networking.k8s.io
              resources:
              - ingresses/status
              verbs:
              - update
            - apiGroups:
              - networking.k8s.io
              resources:
              - ingressclasses
              verbs:
              - get
              - list
              - watch
            - apiGroups:
              - discovery.k8s.io
              resources:
              - endpointslices
              verbs:
              - list
              - watch
              - get
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRole
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission
            rules:
            - apiGroups:
              - admissionregistration.k8s.io
              resources:
              - validatingwebhookconfigurations
              verbs:
              - get
              - update
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: RoleBinding
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx
              namespace: ingress-nginx
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: Role
              name: ingress-nginx
            subjects:
            - kind: ServiceAccount
              name: ingress-nginx
              namespace: ingress-nginx
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: RoleBinding
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission
              namespace: ingress-nginx
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: Role
              name: ingress-nginx-admission
            subjects:
            - kind: ServiceAccount
              name: ingress-nginx-admission
              namespace: ingress-nginx
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              labels:
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: ingress-nginx
            subjects:
            - kind: ServiceAccount
              name: ingress-nginx
              namespace: ingress-nginx
            ---
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: ingress-nginx-admission
            subjects:
            - kind: ServiceAccount
              name: ingress-nginx-admission
              namespace: ingress-nginx
            ---
            apiVersion: v1
            data: null
            kind: ConfigMap
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-controller
              namespace: ingress-nginx
            ---
            apiVersion: v1
            kind: Service
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-controller
              namespace: ingress-nginx
            spec:
              ipFamilies:
              - IPv4
              ipFamilyPolicy: SingleStack
              ports:
              - appProtocol: http
                name: http
                port: 80
                protocol: TCP
                targetPort: http
              - appProtocol: https
                name: https
                port: 443
                protocol: TCP
                targetPort: https
              selector:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
              type: LoadBalancer
            ---
            apiVersion: v1
            kind: Service
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-controller-admission
              namespace: ingress-nginx
            spec:
              ports:
              - appProtocol: https
                name: https-webhook
                port: 443
                targetPort: webhook
              selector:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
              type: ClusterIP
            ---
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-controller
              namespace: ingress-nginx
            spec:
              minReadySeconds: 0
              revisionHistoryLimit: 10
              selector:
                matchLabels:
                  app.kubernetes.io/component: controller
                  app.kubernetes.io/instance: ingress-nginx
                  app.kubernetes.io/name: ingress-nginx
              strategy:
                rollingUpdate:
                  maxUnavailable: 1
                type: RollingUpdate
              template:
                metadata:
                  labels:
                    app.kubernetes.io/component: controller
                    app.kubernetes.io/instance: ingress-nginx
                    app.kubernetes.io/name: ingress-nginx
                    app.kubernetes.io/part-of: ingress-nginx
                    app.kubernetes.io/version: 1.13.2
                spec:
                  automountServiceAccountToken: true
                  containers:
                  - args:
                    - /nginx-ingress-controller
                    - --election-id=ingress-nginx-leader
                    - --controller-class=k8s.io/ingress-nginx
                    - --ingress-class=nginx
                    - --configmap=$(POD_NAMESPACE)/ingress-nginx-controller
                    - --validating-webhook=:8443
                    - --validating-webhook-certificate=/usr/local/certificates/cert
                    - --validating-webhook-key=/usr/local/certificates/key
                    - --watch-ingress-without-class=true
                    - --publish-status-address=localhost
                    env:
                    - name: POD_NAME
                      valueFrom:
                        fieldRef:
                          fieldPath: metadata.name
                    - name: POD_NAMESPACE
                      valueFrom:
                        fieldRef:
                          fieldPath: metadata.namespace
                    - name: LD_PRELOAD
                      value: /usr/local/lib/libmimalloc.so
                    image: registry.k8s.io/ingress-nginx/controller:v1.13.2@sha256:1f7eaeb01933e719c8a9f4acd8181e555e582330c7d50f24484fb64d2ba9b2ef
                    imagePullPolicy: IfNotPresent
                    lifecycle:
                      preStop:
                        exec:
                          command:
                          - /wait-shutdown
                    livenessProbe:
                      failureThreshold: 5
                      httpGet:
                        path: /healthz
                        port: 10254
                        scheme: HTTP
                      initialDelaySeconds: 10
                      periodSeconds: 10
                      successThreshold: 1
                      timeoutSeconds: 1
                    name: controller
                    ports:
                    - containerPort: 80
                      hostPort: 80
                      name: http
                      protocol: TCP
                    - containerPort: 443
                      hostPort: 443
                      name: https
                      protocol: TCP
                    - containerPort: 8443
                      name: webhook
                      protocol: TCP
                    readinessProbe:
                      failureThreshold: 3
                      httpGet:
                        path: /healthz
                        port: 10254
                        scheme: HTTP
                      initialDelaySeconds: 10
                      periodSeconds: 10
                      successThreshold: 1
                      timeoutSeconds: 1
                    resources:
                      requests:
                        cpu: 100m
                        memory: 90Mi
                    securityContext:
                      allowPrivilegeEscalation: false
                      capabilities:
                        add:
                        - NET_BIND_SERVICE
                        drop:
                        - ALL
                      readOnlyRootFilesystem: false
                      runAsGroup: 82
                      runAsNonRoot: true
                      runAsUser: 101
                      seccompProfile:
                        type: RuntimeDefault
                    volumeMounts:
                    - mountPath: /usr/local/certificates/
                      name: webhook-cert
                      readOnly: true
                  dnsPolicy: ClusterFirst
                  nodeSelector:
                    kubernetes.io/os: linux
                  serviceAccountName: ingress-nginx
                  terminationGracePeriodSeconds: 0
                  tolerations:
                  - effect: NoSchedule
                    key: node-role.kubernetes.io/master
                    operator: Equal
                  - effect: NoSchedule
                    key: node-role.kubernetes.io/control-plane
                    operator: Equal
                  volumes:
                  - name: webhook-cert
                    secret:
                      secretName: ingress-nginx-admission
            ---
            apiVersion: batch/v1
            kind: Job
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission-create
              namespace: ingress-nginx
            spec:
              template:
                metadata:
                  labels:
                    app.kubernetes.io/component: admission-webhook
                    app.kubernetes.io/instance: ingress-nginx
                    app.kubernetes.io/name: ingress-nginx
                    app.kubernetes.io/part-of: ingress-nginx
                    app.kubernetes.io/version: 1.13.2
                  name: ingress-nginx-admission-create
                spec:
                  automountServiceAccountToken: true
                  containers:
                  - args:
                    - create
                    - --host=ingress-nginx-controller-admission,ingress-nginx-controller-admission.$(POD_NAMESPACE).svc
                    - --namespace=$(POD_NAMESPACE)
                    - --secret-name=ingress-nginx-admission
                    env:
                    - name: POD_NAMESPACE
                      valueFrom:
                        fieldRef:
                          fieldPath: metadata.namespace
                    image: registry.k8s.io/ingress-nginx/kube-webhook-certgen:v1.6.2@sha256:050a34002d5bb4966849c880c56c91f5320372564245733b33d4b3461b4dbd24
                    imagePullPolicy: IfNotPresent
                    name: create
                    securityContext:
                      allowPrivilegeEscalation: false
                      capabilities:
                        drop:
                        - ALL
                      readOnlyRootFilesystem: true
                      runAsGroup: 65532
                      runAsNonRoot: true
                      runAsUser: 65532
                      seccompProfile:
                        type: RuntimeDefault
                  nodeSelector:
                    kubernetes.io/os: linux
                  restartPolicy: OnFailure
                  serviceAccountName: ingress-nginx-admission
              ttlSecondsAfterFinished: 0
            ---
            apiVersion: batch/v1
            kind: Job
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission-patch
              namespace: ingress-nginx
            spec:
              template:
                metadata:
                  labels:
                    app.kubernetes.io/component: admission-webhook
                    app.kubernetes.io/instance: ingress-nginx
                    app.kubernetes.io/name: ingress-nginx
                    app.kubernetes.io/part-of: ingress-nginx
                    app.kubernetes.io/version: 1.13.2
                  name: ingress-nginx-admission-patch
                spec:
                  automountServiceAccountToken: true
                  containers:
                  - args:
                    - patch
                    - --webhook-name=ingress-nginx-admission
                    - --namespace=$(POD_NAMESPACE)
                    - --patch-mutating=false
                    - --secret-name=ingress-nginx-admission
                    - --patch-failure-policy=Fail
                    env:
                    - name: POD_NAMESPACE
                      valueFrom:
                        fieldRef:
                          fieldPath: metadata.namespace
                    image: registry.k8s.io/ingress-nginx/kube-webhook-certgen:v1.6.2@sha256:050a34002d5bb4966849c880c56c91f5320372564245733b33d4b3461b4dbd24
                    imagePullPolicy: IfNotPresent
                    name: patch
                    securityContext:
                      allowPrivilegeEscalation: false
                      capabilities:
                        drop:
                        - ALL
                      readOnlyRootFilesystem: true
                      runAsGroup: 65532
                      runAsNonRoot: true
                      runAsUser: 65532
                      seccompProfile:
                        type: RuntimeDefault
                  nodeSelector:
                    kubernetes.io/os: linux
                  restartPolicy: OnFailure
                  serviceAccountName: ingress-nginx-admission
              ttlSecondsAfterFinished: 0
            ---
            apiVersion: networking.k8s.io/v1
            kind: IngressClass
            metadata:
              labels:
                app.kubernetes.io/component: controller
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: nginx
            spec:
              controller: k8s.io/ingress-nginx
            ---
            apiVersion: admissionregistration.k8s.io/v1
            kind: ValidatingWebhookConfiguration
            metadata:
              labels:
                app.kubernetes.io/component: admission-webhook
                app.kubernetes.io/instance: ingress-nginx
                app.kubernetes.io/name: ingress-nginx
                app.kubernetes.io/part-of: ingress-nginx
                app.kubernetes.io/version: 1.13.2
              name: ingress-nginx-admission
            webhooks:
            - admissionReviewVersions:
              - v1
              clientConfig:
                service:
                  name: ingress-nginx-controller-admission
                  namespace: ingress-nginx
                  path: /networking/v1/ingresses
                  port: 443
              failurePolicy: Fail
              matchPolicy: Equivalent
              name: validate.nginx.ingress.kubernetes.io
              rules:
              - apiGroups:
                - networking.k8s.io
                apiVersions:
                - v1
                operations:
                - CREATE
                - UPDATE
                resources:
                - ingresses
              sideEffects: None
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./assets/ingress-nginx-deploy.yaml"
      + id                   = (known after apply)
    }

  # null_resource.apply_ingress_nginx will be created
  + resource "null_resource" "apply_ingress_nginx" {
      + id = (known after apply)
    }

  # null_resource.connect_registry will be created
  + resource "null_resource" "connect_registry" {
      + id = (known after apply)
    }

Plan: 23 to add, 0 to change, 0 to destroy.
```

</details>